import datetime

print(datetime.MAXYEAR)
print(datetime.MINYEAR)


# Задание создать функцию в конце которой будет return и убедиться что return является инструкцией
def my_f():
    n_1 = print(input('Enter your name: '))
    return n_1
    # print(return)


my_f()
# print(return)
